import time
import random
time.sleep(1)
print("恭喜您通过高等院校入学测试，获得入学资格！")
time.sleep(1)

while True: # 抽取幸运数字和专业
    a = input("现在，您有一次抽取幸运数字的机会，它将确定您未来的专业，请问您是否要进行抽取？")
    dic1 = {1: "哲学", 2: "逻辑学", 3: "伦理学", 4: "宗教学", 5: "历史学", 6: "考古学", 7: "文物与博物馆学", 8: "世界史", 9: "金融学", 10: "经济学", 11: "国际经济与贸易", 12: "财政学", 13: "动物医学", 14: "园林", 15: "烟草", 16: "农学", 17: "小学教育", 18: "学前教育", 19: "体育教育", 20: "教育学", 21: "法学", 22: "思想政治教育", 23: "侦查学", 24: "社会工作", 25: "数学与应用数学", 26: "心理学", 27: "生物科学", 28: "物理学", 29: "动画", 30: "视觉传达设计", 31: "表演", 32: "数字媒体艺术", 33: "会计学", 34: "电子商务", 35: "工程造价", 36: "工商管理", 37: "汉语言文学", 38: "英语", 39: "网络与新媒体", 40: "新闻学", 41: "口腔医学", 42: "临床医学", 43: "药学", 44: "护理学", 45: "中医学", 46: "计算机科学与技术", 47: "自动化", 48: "软件工程", 49: "人工智能", 50: "电气工程及其自动化"}

    if a == "是":
        time.sleep(1)
        print("系统正在为您抽取幸运数字……请稍候……")
        time.sleep(2)
        b = random.randint(1, 50)
        print(f"恭喜您抽取到幸运数字：{b}，正在根据您的幸运数字生成专业……请稍候……")
    elif a == "否":
        time.sleep(1)
        print("您未选择抽取，系统正在强制为您进行抽取……请稍候……")
        time.sleep(2)
        b = random.randint(1, 50)
        print(f"系统已为您锁定幸运数字：0，正在根据您的幸运数字生成专业……请稍候……")
    else:
        time.sleep(1)
        print("您未输入正确的格式，请重新进行选择！")
        time.sleep(2)
        print("")
        continue

    time.sleep(2)
    print(f"恭喜您获取专业：{dic1[b]}！")
    time.sleep(2)
    print("")
    h = input("如果您对所选专业不满意，请输入“1”进行重新抽取：")
    time.sleep(2)
    if h == "1":
        continue
        time.sleep(2)
    break

print("")

while True: # 选取院校所在地及具体院校
    print("现在，您将有机会在以下几个选项中选择您的大学所在地……")
    time.sleep(1)
    print("A. 蓬莱仙岛；B. 深蓝海岸；C. 阳光绿洲；D. 暗黑森林；E. 星际之都；F. 黄金草原；G. 神秘谷屿；H. 月影湖畔")
    dic2 = {"A": "蓬莱仙岛", "B": "深蓝海岸", "C": "阳光绿洲", "D": "暗黑森林", "E": "星际之都", "F": "黄金草原", "G": "神秘谷屿", "H": "月影湖畔"}
    time.sleep(1)
    c = input("请问您是否要进行选择？")
    if c == "是":
        time.sleep(1)
        d = input("请根据喜好选择您的大学所在地：")
    elif c == "否":
        time.sleep(1)
        list0 = ["A", "B", "C", "D", "E", "F", "G", "H"]
        print("您未进行选择，系统正在随机为您进行选择……请稍候……")
        time.sleep(2)
        d = random.choice(list0)
    else:
        time.sleep(1)
        print("您未输入正确的格式，请重新进行选择！")
        time.sleep(2)
        print("")
        continue

    list1 = ["岛幻科技大学", "蓬莱大学", "云渺大学", "仙屿学院", "云海大学", "仙都大学", "龙宫大学", "神药大学", "海神工程学院", "梦境视觉艺术学院", "青云师范大学", "仙灵音乐学院", "仙草农业大学", "仙龙法学院", "龙宫商学院", "造化研究所", "天宫理工学院", "蓬莱艺术学院", "太白文化学院", "青龙电子科技大学", "天宫国防大学", "如意财经大学"]
    list2 = ["深蓝科技大学", "海天法学院", "海涯大学", "蓝岸医科大学", "海湾大学", "珊瑚工程学院", "海岛大学", "海角农业大学", "海湾金融学院", "海滨科技大学", "海螺信息安全大学", "蔚蓝医科大学", "珊瑚礁环境科学研究院", "蓝鲸海事大学", "碧海理工大学", "深蓝金融大学", "海神宗教学院", "海星政法学院", "蓝海航空航天大学","海胆体育学院", "海蛇农业大学", "海蚀电影电视学院", "青蟹医学研究所"]
    list3 = ["象湖生命科技大学", "绿洲理工大学", "阳光艺术学院", "绿荫经济管理大学", "沙漠工程学院", "绿洲农业大学", "绿叶药科大学", "棕榈金融大学", "翡翠计算机学院", "翠湖外语学院", "翡翠医学研究所",  "野兽生态科学研究院", "翠谷理工大学", "绿洲民族大学"]
    list4 = ["森林资讯科技大学", "暗影金融学院", "黑木文理学院", "幽谷药科大学", "森林资源管理学院", "邪诡工程大学", "冥王工业学院", "暗黑财经学院", "鬼火外国语大学", "暗夜工科大学", "暗夜民族大学", "黑魔法学院", "暗夜武术学院"]
    list5 = ["星辰科技大学", "天壤大学", "星语大学", "星火理工大学", "行星科学研究院", "星际传媒大学", "星际联邦大学", "暗物质研究院", "星海工业大学", "太阳能科技大学", "星际光谱学院", "奇点学院", "尘域学院", "星界研究所", "天枢研究所", "太空农业大学", "星海设计学院", "光年师范大学", "天河工业大学", "星空政法大学", "星云军事学院", "银河外国语大学", "星尘历史学院", "星座环保科学研究院", "星斗工程大学", "星河哲学研究所", "宇宙文化研究院", "星际医科大学", "火星地理信息科学学院", "月球文理学院", "星际航空航天大学", "星火汽车工程学院", "天象数学学院", "太极物理研究所", "太空艺术与科技学院", "碳星财经大学", "星宙体育大学", "星空无垠大学"]
    list6 = ["风云军事学院", "草原财经大学", "草原音乐学院", "铁骑军事大学", "草原经济管理学院", "草原科技大学", "黄金农业大学", "草原艺术学院", "青苔医科大学", "青苗灵学院", "绿草工业大学"]
    list7 = ["奇门大学", "隐者学院", "神秘谷地球物理研究院", "幽谷传媒大学", "神秘哲学研究所", "神秘人类学研究院", "神奇魔法学院", "灵异政法大学", "青山语言文化研究院", "幻境测绘技术学院"]
    list8 = ["明月学院", "夏夜学院", "月华艺术学院", "水波医科大学", "月影水利工程技术大学", "水墨情报科技大学", "月光财经大学", "湖畔工业大学", "月亮湾农业大学", "月华政法学院", "月影艺术与设计研究院"]
    if d == "A":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
        e = random.choice(list1)
    elif d == "B":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        e = random.choice(list2)
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
    elif d == "C":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        e = random.choice(list3)
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
    elif d == "D":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        e = random.choice(list4)
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
    elif d == "E":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
        e = random.choice(list5)
    elif d == "F":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
        e = random.choice(list6)
    elif d == "G":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
        e = random.choice(list7)
    elif d == "H":
        time.sleep(1)
        print(f"恭喜您选择前往：{dic2[d]}进行学习！")
        time.sleep(2)
        print("")
        print("正在为您挑选合适的大学……请稍候……")
        time.sleep(2)
        e = random.choice(list8)
    else:
        time.sleep(1)
        print("您未输入正确的格式，请重新进行选择！")
        time.sleep(2)
        print("")
        continue

    print(f"恭喜您成为：{e}的新生！")
    time.sleep(2)
    print("")
    i = input("如果您对所选院校不满意，请输入“2”进行重新选择：")
    time.sleep(2)
    if i == "2":
        continue
        time.sleep(2)
    print("")

    while True: # 发送录取邮件
        f = input("我校会将录取邮件发送至您的个人邮箱内，请输入您的邮箱地址：")
        time.sleep(1)
        if f == "":
            print("输入不能为空，请重新输入！")
            time.sleep(2)
            continue
        g = input("请再次输入相同的邮箱地址进行确认：")
        time.sleep(1)
        if g == "":
            print("输入不能为空，请重新输入！")
            time.sleep(2)
            continue
        if g != f:
            print("您两次输入的内容不一致，请检查您的邮箱地址，并重新输入！")
            time.sleep(2)
            continue
        break

    print("……")
    time.sleep(1)
    print(f"正在向：{g}发送录取邮件……请稍候……")
    time.sleep(1)
    print("……")
    time.sleep(2)
    print("邮件发送成功！请按照邮件内的说明进行新生确认操作！")
    time.sleep(2)
    print("……后续相关信息将及时发送至您的邮箱，请注意查收！")
    time.sleep(2)
    print("")
    
    while True: # 选择信息汇总报告
        j = input("请问您是否需要信息汇总报告？")
        time.sleep(1)
        if j == "是":
            if a == "否":
                print(f"您的幸运数字为：0；录取专业为：{dic1[b]}；院校地区为：{dic2[d]}；录取院校为：{e}！")
                break
            else:
                print(f"您的幸运数字为：{b}；录取专业为：{dic1[b]}；院校地区为：{dic2[d]}；录取院校为：{e}！")
                break
        elif j == "否":
            print(f"好的，感谢您选择：{e}！")
            break
        else:
            print("您未输入正确的格式，请重新输入！")
            time.sleep(1)
            continue

    print("")
    time.sleep(2)
    print(f"祝您接下来在：{e}的几年，能不断奋进，为自己的未来打下坚实的基础！")
    break
